# dlt

In [18]:
# !pip install dlt[duckdb]

In [8]:
def square_root_generator(limit):
    n = 1
    while n <= limit:
        yield n ** 0.5
        n += 1

# Example usage:
limit = 5
generator = square_root_generator(limit)

for sqrt_value in generator:
    print(sqrt_value)

1.0
1.4142135623730951
1.7320508075688772
2.0
2.23606797749979

# Question 1

In [10]:
total_value = 0

generator = square_root_generator(limit)

for sqrt_value in generator:
    total_value += sqrt_value
    # print(sqrt_value)
    
print('\n', total_value)

 8.382332347441762

# Question 2

In [11]:
limit = 13
generator = square_root_generator(limit)

for sqrt_value in generator:
    # total_value += sqrt_value
    print(sqrt_value)

1.0
1.4142135623730951
1.7320508075688772
2.0
2.23606797749979
2.449489742783178
2.6457513110645907
2.8284271247461903
3.0
3.1622776601683795
3.3166247903554
3.4641016151377544
3.605551275463989

## Question 3

In [1]:
import dlt

In [40]:
pipeline = dlt.pipeline(destination='duckdb', dataset_name='homework_dataset')

In [49]:
def people_1():
    for i in range(1, 6):
        yield {"ID": i, "Name": f"Person_{i}", "Age": 25 + i, "City": "City_A"}
        
# run the pipeline with default settings, and capture the outcome
info = pipeline.run(people_1(), 
                    table_name="homework_table_1", 
                    write_disposition="replace",
                   # merge_key="ID"
                   )

# show the outcome
print(info)

Pipeline dlt_ipykernel_launcher load step completed in 1.08 seconds
1 load package(s) were loaded to destination duckdb and into dataset homework_dataset
The duckdb destination used duckdb:///C:\Users\nimz\Documents\de_zoomcamp\workshops\dlt\dlt_ipykernel_launcher.duckdb location to store data
Load package 1708298938.5372713 is LOADED and contains no failed jobs

In [50]:
# show outcome
import duckdb

conn = duckdb.connect(f"{pipeline.pipeline_name}.duckdb")

# let's see the tables
conn.sql(f"SET search_path = '{pipeline.dataset_name}'")
print('Loaded tables: ')
display(conn.sql("show tables"))

Loaded tables:

┌─────────────────────┐
│        name         │
│       varchar       │
├─────────────────────┤
│ _dlt_loads          │
│ _dlt_loads          │
│ _dlt_pipeline_state │
│ _dlt_pipeline_state │
│ _dlt_version        │
│ _dlt_version        │
│ _dlt_version        │
│ _dlt_version        │
│ homework_table      │
│ homework_table      │
│ homework_table_1    │
├─────────────────────┤
│       11 rows       │
└─────────────────────┘

In [52]:
# and the data

print("\n\n\n http_download table below:")

rides = conn.sql("SELECT * FROM homework_table_1").df()
display(rides)

# As you can see, the same data was loaded in both cases.

 http_download table below:

   id      name  age    city        _dlt_load_id         _dlt_id
0   1  Person_1   26  City_A  1708298938.5372713  PYKtTwSqckgpCQ
1   2  Person_2   27  City_A  1708298938.5372713  3XOQFmgzVlpiKA
2   3  Person_3   28  City_A  1708298938.5372713  +HR9oujlEqI5BQ
3   4  Person_4   29  City_A  1708298938.5372713  ywMTwU5BkpoWxw
4   5  Person_5   30  City_A  1708298938.5372713  Ys/v9gg99HhRsA

In [53]:
def people_2():
    for i in range(3, 9):
        yield {"ID": i, "Name": f"Person_{i}", "Age": 30 + i, "City": "City_B", "Occupation": f"Job_{i}"}
        
# run the pipeline with default settings, and capture the outcome
info = pipeline.run(people_2(), 
                    table_name="homework_table_1", 
                    write_disposition="append",
                   )

# show the outcome
print(info)

Pipeline dlt_ipykernel_launcher load step completed in 0.34 seconds
1 load package(s) were loaded to destination duckdb and into dataset homework_dataset
The duckdb destination used duckdb:///C:\Users\nimz\Documents\de_zoomcamp\workshops\dlt\dlt_ipykernel_launcher.duckdb location to store data
Load package 1708298993.5530512 is LOADED and contains no failed jobs

In [54]:
# and the data

print("\n\n\n http_download table below:")

rides = conn.sql("SELECT * FROM homework_table_1").df()
display(rides)

# As you can see, the same data was loaded in both cases.

 http_download table below:

    id      name  age    city        _dlt_load_id         _dlt_id occupation
0    1  Person_1   26  City_A  1708298938.5372713  PYKtTwSqckgpCQ        NaN
1    2  Person_2   27  City_A  1708298938.5372713  3XOQFmgzVlpiKA        NaN
2    3  Person_3   28  City_A  1708298938.5372713  +HR9oujlEqI5BQ        NaN
3    4  Person_4   29  City_A  1708298938.5372713  ywMTwU5BkpoWxw        NaN
4    5  Person_5   30  City_A  1708298938.5372713  Ys/v9gg99HhRsA        NaN
5    3  Person_3   33  City_B  1708298993.5530512  IgIjixDMzNv/OA      Job_3
6    4  Person_4   34  City_B  1708298993.5530512  gGgYJF+VgIWlPg      Job_4
7    5  Person_5   35  City_B  1708298993.5530512  MvOx1jTvybn8ag      Job_5
8    6  Person_6   36  City_B  1708298993.5530512  80I0bZA3Jpvs5g      Job_6
9    7  Person_7   37  City_B  1708298993.5530512  T0g3p/uysx/jLA      Job_7
10   8  Person_8   38  City_B  1708298993.5530512  fsK1ErIDlhqvNQ      Job_8

In [55]:
rides = conn.sql("SELECT SUM(age) FROM homework_table_1").df()
display(rides)

   sum(age)
0     353.0

## Question 4

In [56]:
def people_1():
    for i in range(1, 6):
        yield {"ID": i, "Name": f"Person_{i}", "Age": 25 + i, "City": "City_A"}
        
# run the pipeline with default settings, and capture the outcome
info = pipeline.run(people_1(), 
                    table_name="homework_table_2", 
                    write_disposition="replace",
                   # merge_key="ID"
                   )

# show the outcome
print(info)

Pipeline dlt_ipykernel_launcher load step completed in 0.39 seconds
1 load package(s) were loaded to destination duckdb and into dataset homework_dataset
The duckdb destination used duckdb:///C:\Users\nimz\Documents\de_zoomcamp\workshops\dlt\dlt_ipykernel_launcher.duckdb location to store data
Load package 1708299052.3107886 is LOADED and contains no failed jobs

In [57]:
def people_2():
    for i in range(3, 9):
        yield {"ID": i, "Name": f"Person_{i}", "Age": 30 + i, "City": "City_B", "Occupation": f"Job_{i}"}
        
# run the pipeline with default settings, and capture the outcome
info = pipeline.run(people_2(), 
                    table_name="homework_table_2", 
                    write_disposition="merge",
                    primary_key='ID'
                   # merge_key="ID"
                   )

# show the outcome
print(info)

Pipeline dlt_ipykernel_launcher load step completed in 0.77 seconds
1 load package(s) were loaded to destination duckdb and into dataset homework_dataset
The duckdb destination used duckdb:///C:\Users\nimz\Documents\de_zoomcamp\workshops\dlt\dlt_ipykernel_launcher.duckdb location to store data
Load package 1708299054.4555738 is LOADED and contains no failed jobs

In [58]:
# show outcome
import duckdb

conn = duckdb.connect(f"{pipeline.pipeline_name}.duckdb")

# let's see the tables
conn.sql(f"SET search_path = '{pipeline.dataset_name}'")
print('Loaded tables: ')
display(conn.sql("show tables"))

Loaded tables:

┌─────────────────────┐
│        name         │
│       varchar       │
├─────────────────────┤
│ _dlt_loads          │
│ _dlt_loads          │
│ _dlt_pipeline_state │
│ _dlt_pipeline_state │
│ _dlt_version        │
│ _dlt_version        │
│ _dlt_version        │
│ _dlt_version        │
│ homework_table      │
│ homework_table      │
│ homework_table_1    │
│ homework_table_2    │
│ homework_table_2    │
├─────────────────────┤
│       13 rows       │
└─────────────────────┘

In [59]:
# and the data

print("\n\n\n http_download table below:")

rides = conn.sql("SELECT * FROM homework_table_2").df()
display(rides)

# As you can see, the same data was loaded in both cases.

 http_download table below:

   id      name  age    city        _dlt_load_id         _dlt_id occupation
0   1  Person_1   26  City_A  1708299052.3107886  fqxrPENz7BhwPg        NaN
1   2  Person_2   27  City_A  1708299052.3107886  6bWsrfRRHx2L4g        NaN
2   5  Person_5   35  City_B  1708299054.4555738  bCLTNv7LrzKv0g      Job_5
3   3  Person_3   33  City_B  1708299054.4555738  QSpSpd5CueTmIg      Job_3
4   4  Person_4   34  City_B  1708299054.4555738  CMwXOfHdC0qyPg      Job_4
5   6  Person_6   36  City_B  1708299054.4555738  Mrn4VjXzo5+rug      Job_6
6   7  Person_7   37  City_B  1708299054.4555738  Ir/3CChTo/Ts1w      Job_7
7   8  Person_8   38  City_B  1708299054.4555738  rvccV9wgjfsylw      Job_8

In [60]:
rides = conn.sql("SELECT SUM(age) FROM homework_table_2").df()
display(rides)

   sum(age)
0     266.0